{
  "description": [
    "Software developer with almost 5 years of experience delivering web-based solutions. Specialized in front-end development using JavaScript, TypeScript, React, Angular, and Node to build efficient and user-friendly interfaces.",
    "I have hands-on experience across the entire software development lifecycle, from planning to deployment and maintenance. I've collaborated with international teams, effectively communicating fluently in English, Spanish, and Portuguese to ensure project success.",
    "I am a Brazilian citizen, open to relocation, have availability for travel, and can start immediately. I am also flexible to work remotely or on-site."
  ],
  "skills": [
    {
      "category": "Front-End",
      "items": [
        "React",
        "Next.js",
        "Redux",
        "Material-UI",
        "Tailwind CSS",
        "Angular",
        "Sass",
        "Bootstrap"
      ]
    },
    {
      "category": "Languages",
      "items": ["JavaScript", "TypeScript", "HTML", "CSS", "Python", "SQL"]
    },
    {
      "category": "Testing",
      "items": ["Jest", "Cypress", "Storybook", "Selenium"]
    },
    {
      "category": "Tools",
      "items": [
        "Git",
        "GitHub",
        "GitLab",
        "Jira",
        "Trello",
        "Slack",
        "Docker",
        "GitFlow",
        "Confluence",
        "GitHub Actions"
      ]
    },
    {
      "category": "Methodologies",
      "items": [
        "Agile",
        "Scrum",
        "Kanban",
        "Test Driven Development (TDD)",
        "SAFe Scrum",
        "XP Programming"
      ]
    },
    {
      "category": "Back-End & Databases",
      "items": ["Node.js", "Express", "MongoDB", "MySQL"]
    },
    {
      "category": "Mobile & Desktop",
      "items": ["React Native", "Expo", "Electron"]
    },
    {
      "category": "Other",
      "items": [
        "CI/CD workflow",
        "Accessibility",
        "Google Analytics",
        "Web Scraping",
        "Artificial Intelligence"
      ]
    }
  ],
  "hobbies": [
    "I love adventure and exploring cool, unusual places. I've hitchhiked across two continents and found spots most people don't even know exist. Sometimes I work while traveling as a digital nomad, and every now and then, I like to push myself like going on a 10-day hike just for fun!",
    "I'm really into learning languages. Right now, I'm studying Mandarin Chinese. In addition to speaking fluently English, Portuguese, Spanish, and Esperanto, I've also learned a bit of French, Russian, Arabic, Brazilian Sign Language (Libras), and even Toki Pona. Talking to people in their own language is awesome!",
    "I don't just work with tech, I live for it. Front-end development isn't just my job, it's my passion. I love designing cool UIs, whether for work or personal projects. I even have fun customizing my VSCode setup and tweaking my old Linux system just because I can."
  ]
}
